[
  {
    "id": 1,
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://i.ibb.co.com/Qvk0MyV1/silent.jpg",
    "review": "A gripping psychological thriller with an unexpected twist, *The Silent Patient* will keep you on the edge of your seat. Alicia Berenson, a celebrated painter, shoots her husband in the face and then goes silent. A psychotherapist, Theo Faber, is obsessed with uncovering the reasons behind her silence. The twists in the narrative will leave you questioning everything until the very last page. With an intricate plot and deep psychological insights, this book explores themes of love, betrayal, and mental health in a way thats both haunting and thought-provoking.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Thriller",
    "tags": ["Suspense", "Psychological"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  },
  {
    "id": 2,
    "bookName": "Atomic Habits",
    "author": "James Clear",
    "image": "https://i.ibb.co.com/DfdYxx9v/atomic.jpg",
    "review": "*Atomic Habits* offers a revolutionary approach to habit formation that focuses on making tiny, incremental changes. James Clear explains how small habits compound over time to create significant transformations in our lives. Whether you want to improve your productivity, health, or mindset, this book provides practical strategies that anyone can implement. Clear’s focus on the power of '1% improvements' encourages readers to start with small, achievable goals that lead to big results, making it a must-read for anyone striving to make lasting changes in their daily life.",
    "totalPages": 320,
    "rating": 4.8,
    "category": "Self-Help",
    "tags": ["Motivation", "Productivity"],
    "publisher": "Avery",
    "yearOfPublishing": 2018
  },
  {
    "id": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co.com/9H1ZbCbK/1984.jpg",
    "review": "George Orwell's *1984* is a dystopian masterpiece that remains eerily relevant in today’s world. Set in a totalitarian regime where the state controls every aspect of life, the novel follows Winston Smith, a man who begins to question the oppressive government he lives under. With themes of surveillance, censorship, and the manipulation of truth, Orwell crafts a chilling narrative that warns of the dangers of unchecked power. *1984* is a timeless political and philosophical commentary that makes readers think critically about the world they live in.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Dystopian",
    "tags": ["Classic", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "id": 4,
    "bookName": "The Midnight Library",
    "author": "Matt Haig",
    "image": "https://i.ibb.co.com/dJbFy1pW/midnight.webp",
    "review": "*The Midnight Library* offers a heartwarming and thought-provoking journey through the infinite possibilities of life. Nora Seed, the protagonist, finds herself in a library between life and death, where each book represents an alternate version of her life, shaped by the choices she could have made. This captivating story explores themes of regret, the impact of decisions, and the power of second chances. Matt Haig’s writing is both deeply philosophical and emotionally uplifting, making it a perfect read for anyone searching for meaning or trying to understand the value of their choices.",
    "totalPages": 304,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Fantasy", "Philosophical"],
    "publisher": "Canongate Books",
    "yearOfPublishing": 2020
  },
  {
    "id": 5,
    "bookName": "Becoming",
    "author": "Michelle Obama",
    "image": "https://i.ibb.co.com/Wvwr6xdb/becoming.webp",
    "review": "In her memoir *Becoming*, Michelle Obama shares an intimate look at her life, from her childhood on the South Side of Chicago to her time as First Lady of the United States. Her personal journey is one of resilience, growth, and empowerment. With grace and honesty, Obama reflects on the challenges she faced and the triumphs she achieved, offering readers inspiration and insight into how she navigated the complexities of race, identity, and leadership. This memoir is not just for fans of Michelle Obama but for anyone who seeks to better understand the power of self-determination and purpose.",
    "totalPages": 448,
    "rating": 4.9,
    "category": "Biography",
    "tags": ["Inspiration", "Leadership"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2018
  },
  {
    "id": 6,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co.com/rK794FPH/alcemist.jpg",
    "review": "Paulo Coelho’s *The Alchemist* is a beautiful allegorical novel about a young shepherd named Santiago who embarks on a journey to find a hidden treasure. Along the way, he learns valuable life lessons about following his dreams, listening to his heart, and recognizing the signs the universe provides. This novel touches on themes of personal growth, destiny, and the interconnectedness of all things. With its simple yet profound wisdom, *The Alchemist* has become a beloved global classic, inspiring readers to pursue their own 'Personal Legend' and never give up on their dreams.",
    "totalPages": 208,
    "rating": 4.7,
    "category": "Adventure",
    "tags": ["Philosophy", "Spiritual"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  }
]
